Revit 2026 API

# AssetPropertyDoubleArray4dIsValidValue(IListDouble) Method

---
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidValue(
	IList<double> value
)
```
```vb
Public Function IsValidValue (
	value As IList(Of Double)
) As Boolean
```
```cpp
public:
bool IsValidValue(
	IList<double>^ value
)
```
```fsharp
member IsValidValue :
        value : IList<float> -> bool
```

#### Parameters

value IListDouble

#### Return Value

Boolean

#### Reference

AssetPropertyDoubleArray4d Class

IsValidValue Overload

Autodesk.Revit.DB.Visual Namespace